Revit 2024 API
PrimarySizeCriterion.None Method
 Creates a criterion with a range of no sizes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static PrimarySizeCriterion None()
Visual Basic
Public Shared Function None As PrimarySizeCriterion
Visual C++
public:
static PrimarySizeCriterion^ None()
Return Value
 The new criterion.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
PrimarySizeCriterion Class
Autodesk.Revit.DB Namespace